major = [0,4,3]; //Мажорный аккорд
minor = [0,3,4]; //Минорный аккорд
diminished = [0,3,3]; //
augmented = [0,4,4]; //
dominant7 = [0,4,3,3]; //
maj7 = [0,4,3,4]; //Большой мажорный септаккорд
lowMinor7 = [0,3,4,3]; //Малый минорный септаккорд
sus4 = [0,5,2]; //Аккорд c задержанием на IV ступень
major6 = [0,4,3,2]; //Мажорный секстаккорд

major6_9 = [0,4,3,2,5]; //Мажорный секстаккорд с добавленной IX (ноной) ступенью (6/9)
maj9 = [0,4,3,3,4]; //Мажорный нонаккорд
maj11 = [0,4,3,3,4,3] //Мажорный ундецимаккорд
maj13 = [0,4,3,3,4,3,4] //Мажорный терцдецимаккорд

sus2 = [0,2,5]; //Аккорд c задержанием на II ступень
power = [0,7,5]; //Пауэр-аккорд на квинте
low7 = [0,4,3,3]; //Малый мажорный септаккорд
dim7 = [0,3,3,3]; //Уменьшенный септаккорд
add9 = [0,4,3,7]; //Мажорный аккорд с добавленной IX ступенью 
add13 = [0,4,3,14]; //Мажорный аккорд с добавленной XIII ступенью